server17/mediaMicroservices/wrk2/two_choice_compose_output4.txt
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     6.77ms    4.13ms  23.22ms   87.97%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.22ms
 75.000%    7.59ms
 90.000%   11.81ms
 99.000%   23.22ms
 99.900%   37.18ms
 99.990%   38.65ms
 99.999%   38.65ms
100.000%   38.65ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.185     0.000000            1         1.00
       3.831     0.100000          199         1.11
       4.107     0.200000          401         1.25
       4.443     0.300000          598         1.43
       4.795     0.400000          798         1.67
       5.223     0.500000          995         2.00
       5.507     0.550000         1094         2.22
       5.911     0.600000         1194         2.50
       6.367     0.650000         1292         2.86
       6.911     0.700000         1391         3.33
       7.591     0.750000         1493         4.00
       7.979     0.775000         1541         4.44
       8.487     0.800000         1590         5.00
       9.071     0.825000         1640         5.71
       9.767     0.850000         1689         6.67
      10.767     0.875000         1739         8.00
      11.175     0.887500         1764         8.89
      11.847     0.900000         1789        10.00
      12.511     0.912500         1814        11.43
      13.215     0.925000         1838        13.33
      14.079     0.937500         1863        16.00
      14.439     0.943750         1876        17.78
      15.255     0.950000         1888        20.00
      16.039     0.956250         1901        22.86
      16.671     0.962500         1913        26.67
      17.423     0.968750         1925        32.00
      17.807     0.971875         1932        35.56
      18.799     0.975000         1938        40.00
      19.439     0.978125         1944        45.71
      20.271     0.981250         1950        53.33
      21.279     0.984375         1956        64.00
      21.759     0.985938         1960        71.11
      22.911     0.987500         1963        80.00
      23.199     0.989062         1966        91.43
      23.663     0.990625         1969       106.67
      24.591     0.992188         1972       128.00
      24.815     0.992969         1974       142.22
      25.679     0.993750         1975       160.00
      26.191     0.994531         1977       182.86
      26.319     0.995313         1978       213.33
      26.703     0.996094         1980       256.00
      26.943     0.996484         1981       284.44
      26.943     0.996875         1981       320.00
      27.215     0.997266         1982       365.71
      31.503     0.997656         1983       426.67
      36.703     0.998047         1984       512.00
      36.703     0.998242         1984       568.89
      36.703     0.998437         1984       640.00
      37.183     0.998633         1985       731.43
      37.183     0.998828         1985       853.33
      38.527     0.999023         1986      1024.00
      38.527     0.999121         1986      1137.78
      38.527     0.999219         1986      1280.00
      38.527     0.999316         1986      1462.86
      38.527     0.999414         1986      1706.67
      38.655     0.999512         1987      2048.00
      38.655     1.000000         1987          inf
#[Mean    =        6.769, StdDeviation   =        4.135]
#[Max     =       38.624, Total count    =         1987]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1988 requests in 10.01s, 702.79KB read
  Socket errors: connect 0, read 0, write 0, timeout 5
  Non-2xx or 3xx responses: 1988
Requests/sec:    198.69
Transfer/sec:     70.24KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     5.87ms    2.52ms  14.90ms   86.17%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.08ms
 75.000%    6.76ms
 90.000%    8.92ms
 99.000%   14.90ms
 99.900%   24.13ms
 99.990%   31.61ms
 99.999%   31.61ms
100.000%   31.61ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.053     0.000000            1         1.00
       3.761     0.100000          301         1.11
       4.027     0.200000          599         1.25
       4.339     0.300000          899         1.43
       4.675     0.400000         1195         1.67
       5.079     0.500000         1489         2.00
       5.355     0.550000         1638         2.22
       5.663     0.600000         1787         2.50
       5.987     0.650000         1938         2.86
       6.331     0.700000         2086         3.33
       6.759     0.750000         2234         4.00
       6.999     0.775000         2308         4.44
       7.287     0.800000         2383         5.00
       7.679     0.825000         2457         5.71
       8.015     0.850000         2533         6.67
       8.447     0.875000         2606         8.00
       8.727     0.887500         2643         8.89
       8.935     0.900000         2682        10.00
       9.239     0.912500         2718        11.43
       9.679     0.925000         2755        13.33
      10.007     0.937500         2792        16.00
      10.207     0.943750         2811        17.78
      10.463     0.950000         2830        20.00
      10.695     0.956250         2848        22.86
      11.127     0.962500         2867        26.67
      11.567     0.968750         2885        32.00
      11.831     0.971875         2895        35.56
      12.239     0.975000         2904        40.00
      12.471     0.978125         2913        45.71
      13.103     0.981250         2923        53.33
      13.551     0.984375         2932        64.00
      13.975     0.985938         2937        71.11
      14.319     0.987500         2942        80.00
      14.823     0.989062         2946        91.43
      15.279     0.990625         2951       106.67
      15.535     0.992188         2955       128.00
      16.351     0.992969         2958       142.22
      16.559     0.993750         2960       160.00
      17.023     0.994531         2962       182.86
      17.599     0.995313         2965       213.33
      19.215     0.996094         2967       256.00
      20.703     0.996484         2968       284.44
      20.927     0.996875         2969       320.00
      21.567     0.997266         2970       365.71
      22.943     0.997656         2972       426.67
      22.959     0.998047         2973       512.00
      22.959     0.998242         2973       568.89
      23.631     0.998437         2974       640.00
      23.631     0.998633         2974       731.43
      24.127     0.998828         2975       853.33
      24.399     0.999023         2976      1024.00
      24.399     0.999121         2976      1137.78
      24.399     0.999219         2976      1280.00
      24.399     0.999316         2976      1462.86
      26.895     0.999414         2977      1706.67
      26.895     0.999512         2977      2048.00
      26.895     0.999561         2977      2275.56
      26.895     0.999609         2977      2560.00
      26.895     0.999658         2977      2925.71
      31.615     0.999707         2978      3413.33
      31.615     1.000000         2978          inf
#[Mean    =        5.870, StdDeviation   =        2.521]
#[Max     =       31.600, Total count    =         2978]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2979 requests in 10.00s, 1.03MB read
  Socket errors: connect 0, read 0, write 0, timeout 1
  Non-2xx or 3xx responses: 2979
Requests/sec:    297.92
Transfer/sec:    105.32KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.01ms    3.99ms  22.38ms   89.06%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    5.78ms
 75.000%    8.07ms
 90.000%   11.36ms
 99.000%   22.38ms
 99.900%   37.69ms
 99.990%   52.67ms
 99.999%   52.67ms
100.000%   52.67ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.107     0.000000            1         1.00
       3.915     0.100000          397         1.11
       4.331     0.200000          795         1.25
       4.759     0.300000         1193         1.43
       5.219     0.400000         1597         1.67
       5.779     0.500000         1987         2.00
       6.111     0.550000         2182         2.22
       6.511     0.600000         2381         2.50
       6.975     0.650000         2579         2.86
       7.447     0.700000         2777         3.33
       8.083     0.750000         2976         4.00
       8.479     0.775000         3077         4.44
       8.815     0.800000         3174         5.00
       9.255     0.825000         3273         5.71
       9.799     0.850000         3372         6.67
      10.583     0.875000         3472         8.00
      10.943     0.887500         3523         8.89
      11.359     0.900000         3571        10.00
      11.823     0.912500         3620        11.43
      12.423     0.925000         3670        13.33
      13.167     0.937500         3720        16.00
      13.615     0.943750         3744        17.78
      14.151     0.950000         3770        20.00
      14.975     0.956250         3794        22.86
      15.471     0.962500         3819        26.67
      16.415     0.968750         3845        32.00
      16.879     0.971875         3856        35.56
      17.471     0.975000         3869        40.00
      18.223     0.978125         3881        45.71
      19.023     0.981250         3893        53.33
      19.807     0.984375         3906        64.00
      20.223     0.985938         3912        71.11
      21.471     0.987500         3918        80.00
      22.287     0.989062         3924        91.43
      23.359     0.990625         3930       106.67
      24.143     0.992188         3937       128.00
      25.343     0.992969         3940       142.22
      26.783     0.993750         3943       160.00
      27.311     0.994531         3946       182.86
      28.223     0.995313         3949       213.33
      30.287     0.996094         3952       256.00
      30.527     0.996484         3954       284.44
      30.591     0.996875         3955       320.00
      31.279     0.997266         3957       365.71
      35.007     0.997656         3958       426.67
      35.231     0.998047         3960       512.00
      35.615     0.998242         3961       568.89
      35.615     0.998437         3961       640.00
      36.959     0.998633         3962       731.43
      37.695     0.998828         3963       853.33
      39.871     0.999023         3964      1024.00
      39.871     0.999121         3964      1137.78
      39.871     0.999219         3964      1280.00
      41.343     0.999316         3965      1462.86
      41.343     0.999414         3965      1706.67
      51.935     0.999512         3966      2048.00
      51.935     0.999561         3966      2275.56
      51.935     0.999609         3966      2560.00
      51.935     0.999658         3966      2925.71
      51.935     0.999707         3966      3413.33
      52.671     0.999756         3967      4096.00
      52.671     1.000000         3967          inf
#[Mean    =        7.006, StdDeviation   =        3.994]
#[Max     =       52.640, Total count    =         3967]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  3968 requests in 10.00s, 1.37MB read
  Non-2xx or 3xx responses: 3968
Requests/sec:    396.79
Transfer/sec:    140.27KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     8.05ms    4.26ms  23.14ms   83.06%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.83ms
 75.000%    9.75ms
 90.000%   13.53ms
 99.000%   23.14ms
 99.900%   33.47ms
 99.990%   44.06ms
 99.999%   44.06ms
100.000%   44.06ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.141     0.000000            1         1.00
       4.247     0.100000          495         1.11
       4.763     0.200000          990         1.25
       5.299     0.300000         1485         1.43
       5.995     0.400000         1979         1.67
       6.831     0.500000         2473         2.00
       7.243     0.550000         2721         2.22
       7.779     0.600000         2969         2.50
       8.319     0.650000         3219         2.86
       8.991     0.700000         3465         3.33
       9.751     0.750000         3711         4.00
      10.159     0.775000         3835         4.44
      10.655     0.800000         3957         5.00
      11.279     0.825000         4081         5.71
      11.911     0.850000         4205         6.67
      12.599     0.875000         4329         8.00
      12.999     0.887500         4390         8.89
      13.535     0.900000         4452        10.00
      14.023     0.912500         4514        11.43
      14.727     0.925000         4578        13.33
      15.503     0.937500         4637        16.00
      15.959     0.943750         4669        17.78
      16.447     0.950000         4699        20.00
      16.975     0.956250         4730        22.86
      17.503     0.962500         4761        26.67
      18.591     0.968750         4792        32.00
      18.927     0.971875         4807        35.56
      19.391     0.975000         4823        40.00
      19.839     0.978125         4839        45.71
      20.255     0.981250         4854        53.33
      20.991     0.984375         4869        64.00
      21.615     0.985938         4877        71.11
      22.335     0.987500         4885        80.00
      22.703     0.989062         4892        91.43
      23.647     0.990625         4901       106.67
      24.239     0.992188         4908       128.00
      24.479     0.992969         4912       142.22
      25.471     0.993750         4916       160.00
      26.079     0.994531         4919       182.86
      27.567     0.995313         4923       213.33
      28.143     0.996094         4927       256.00
      29.135     0.996484         4929       284.44
      29.247     0.996875         4931       320.00
      29.519     0.997266         4933       365.71
      30.943     0.997656         4935       426.67
      31.727     0.998047         4937       512.00
      31.871     0.998242         4938       568.89
      31.983     0.998437         4939       640.00
      32.207     0.998633         4940       731.43
      33.471     0.998828         4941       853.33
      34.591     0.999023         4942      1024.00
      34.591     0.999121         4942      1137.78
      34.687     0.999219         4943      1280.00
      34.687     0.999316         4943      1462.86
      37.055     0.999414         4944      1706.67
      37.055     0.999512         4944      2048.00
      37.055     0.999561         4944      2275.56
      39.967     0.999609         4945      2560.00
      39.967     0.999658         4945      2925.71
      39.967     0.999707         4945      3413.33
      39.967     0.999756         4945      4096.00
      39.967     0.999780         4945      4551.11
      44.063     0.999805         4946      5120.00
      44.063     1.000000         4946          inf
#[Mean    =        8.052, StdDeviation   =        4.257]
#[Max     =       44.032, Total count    =         4946]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4948 requests in 10.00s, 1.71MB read
  Non-2xx or 3xx responses: 4948
Requests/sec:    494.74
Transfer/sec:    174.90KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    10.90ms    6.84ms  36.99ms   86.34%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.89ms
 75.000%   13.25ms
 90.000%   19.28ms
 99.000%   36.99ms
 99.900%   53.57ms
 99.990%   59.68ms
 99.999%   60.54ms
100.000%   60.54ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.351     0.000000            1         1.00
       4.931     0.100000          596         1.11
       5.771     0.200000         1189         1.25
       6.707     0.300000         1787         1.43
       7.731     0.400000         2381         1.67
       8.887     0.500000         2975         2.00
       9.519     0.550000         3271         2.22
      10.327     0.600000         3568         2.50
      11.159     0.650000         3866         2.86
      12.143     0.700000         4162         3.33
      13.247     0.750000         4461         4.00
      13.951     0.775000         4608         4.44
      14.695     0.800000         4756         5.00
      15.663     0.825000         4907         5.71
      16.543     0.850000         5055         6.67
      17.471     0.875000         5204         8.00
      18.239     0.887500         5278         8.89
      19.279     0.900000         5351        10.00
      20.271     0.912500         5425        11.43
      21.311     0.925000         5501        13.33
      22.559     0.937500         5574        16.00
      23.279     0.943750         5612        17.78
      24.191     0.950000         5648        20.00
      25.071     0.956250         5686        22.86
      26.287     0.962500         5723        26.67
      27.999     0.968750         5760        32.00
      28.719     0.971875         5778        35.56
      29.727     0.975000         5797        40.00
      30.831     0.978125         5816        45.71
      32.383     0.981250         5835        53.33
      33.503     0.984375         5853        64.00
      34.239     0.985938         5864        71.11
      35.167     0.987500         5871        80.00
      36.319     0.989062         5880        91.43
      37.407     0.990625         5890       106.67
      38.751     0.992188         5899       128.00
      39.903     0.992969         5904       142.22
      40.735     0.993750         5908       160.00
      43.039     0.994531         5913       182.86
      43.679     0.995313         5918       213.33
      46.207     0.996094         5922       256.00
      47.135     0.996484         5925       284.44
      47.679     0.996875         5927       320.00
      48.319     0.997266         5929       365.71
      48.799     0.997656         5932       426.67
      50.719     0.998047         5934       512.00
      50.783     0.998242         5935       568.89
      51.519     0.998437         5936       640.00
      52.639     0.998633         5937       731.43
      53.567     0.998828         5939       853.33
      54.687     0.999023         5940      1024.00
      54.687     0.999121         5940      1137.78
      54.847     0.999219         5941      1280.00
      54.847     0.999316         5941      1462.86
      55.711     0.999414         5942      1706.67
      58.175     0.999512         5943      2048.00
      58.175     0.999561         5943      2275.56
      58.175     0.999609         5943      2560.00
      58.175     0.999658         5943      2925.71
      59.679     0.999707         5944      3413.33
      59.679     0.999756         5944      4096.00
      59.679     0.999780         5944      4551.11
      59.679     0.999805         5944      5120.00
      59.679     0.999829         5944      5851.43
      60.543     0.999854         5945      6826.67
      60.543     1.000000         5945          inf
#[Mean    =       10.897, StdDeviation   =        6.843]
#[Max     =       60.512, Total count    =         5945]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5946 requests in 10.00s, 2.05MB read
  Non-2xx or 3xx responses: 5946
Requests/sec:    594.34
Transfer/sec:    210.11KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    14.99ms   10.71ms  54.56ms   86.36%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.81ms
 75.000%   18.66ms
 90.000%   28.06ms
 99.000%   54.56ms
 99.900%   85.44ms
 99.990%  110.91ms
 99.999%  124.03ms
100.000%  124.03ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.323     0.000000            1         1.00
       5.707     0.100000          693         1.11
       7.119     0.200000         1385         1.25
       8.471     0.300000         2077         1.43
      10.007     0.400000         2766         1.67
      11.807     0.500000         3458         2.00
      12.807     0.550000         3803         2.22
      13.943     0.600000         4150         2.50
      15.271     0.650000         4496         2.86
      16.895     0.700000         4842         3.33
      18.655     0.750000         5187         4.00
      19.663     0.775000         5359         4.44
      20.815     0.800000         5532         5.00
      22.223     0.825000         5707         5.71
      23.871     0.850000         5877         6.67
      25.839     0.875000         6050         8.00
      26.911     0.887500         6137         8.89
      28.063     0.900000         6225        10.00
      29.535     0.912500         6312        11.43
      31.247     0.925000         6397        13.33
      33.151     0.937500         6483        16.00
      34.463     0.943750         6527        17.78
      35.679     0.950000         6569        20.00
      37.247     0.956250         6613        22.86
      39.103     0.962500         6655        26.67
      41.407     0.968750         6698        32.00
      42.751     0.971875         6720        35.56
      44.191     0.975000         6742        40.00
      45.343     0.978125         6763        45.71
      46.847     0.981250         6785        53.33
      49.279     0.984375         6806        64.00
      50.207     0.985938         6817        71.11
      52.927     0.987500         6828        80.00
      53.695     0.989062         6839        91.43
      56.191     0.990625         6850       106.67
      57.727     0.992188         6860       128.00
      59.071     0.992969         6866       142.22
      61.759     0.993750         6871       160.00
      63.007     0.994531         6877       182.86
      66.943     0.995313         6883       213.33
      69.311     0.996094         6887       256.00
      72.575     0.996484         6890       284.44
      73.023     0.996875         6893       320.00
      74.111     0.997266         6896       365.71
      75.263     0.997656         6898       426.67
      76.799     0.998047         6901       512.00
      77.951     0.998242         6902       568.89
      81.471     0.998437         6904       640.00
      84.991     0.998633         6905       731.43
      85.183     0.998828         6906       853.33
      85.695     0.999023         6908      1024.00
      85.695     0.999121         6908      1137.78
      86.207     0.999219         6910      1280.00
      86.207     0.999316         6910      1462.86
      86.207     0.999414         6910      1706.67
      89.983     0.999512         6911      2048.00
      89.983     0.999561         6911      2275.56
      92.095     0.999609         6912      2560.00
      92.095     0.999658         6912      2925.71
      92.095     0.999707         6912      3413.33
     110.911     0.999756         6913      4096.00
     110.911     0.999780         6913      4551.11
     110.911     0.999805         6913      5120.00
     110.911     0.999829         6913      5851.43
     110.911     0.999854         6913      6826.67
     124.031     0.999878         6914      8192.00
     124.031     1.000000         6914          inf
#[Mean    =       14.990, StdDeviation   =       10.706]
#[Max     =      123.968, Total count    =         6914]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  6915 requests in 10.00s, 2.39MB read
  Non-2xx or 3xx responses: 6915
Requests/sec:    691.32
Transfer/sec:    244.39KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   167.54ms  233.37ms   1.08s    87.19%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   60.51ms
 75.000%  218.75ms
 90.000%  476.16ms
 99.000%    1.08s 
 99.900%    1.41s 
 99.990%    1.55s 
 99.999%    1.59s 
100.000%    1.59s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       3.877     0.000000            1         1.00
      10.207     0.100000          789         1.11
      15.759     0.200000         1578         1.25
      22.303     0.300000         2366         1.43
      31.887     0.400000         3154         1.67
      60.511     0.500000         3942         2.00
      88.191     0.550000         4338         2.22
     118.719     0.600000         4733         2.50
     144.895     0.650000         5125         2.86
     178.815     0.700000         5519         3.33
     218.751     0.750000         5913         4.00
     246.655     0.775000         6111         4.44
     275.455     0.800000         6309         5.00
     316.927     0.825000         6508         5.71
     355.583     0.850000         6703         6.67
     407.295     0.875000         6899         8.00
     434.431     0.887500         6998         8.89
     476.159     0.900000         7098        10.00
     517.887     0.912500         7195        11.43
     570.879     0.925000         7294        13.33
     622.591     0.937500         7392        16.00
     655.359     0.943750         7441        17.78
     688.127     0.950000         7490        20.00
     729.087     0.956250         7540        22.86
     773.119     0.962500         7589        26.67
     815.103     0.968750         7639        32.00
     840.703     0.971875         7663        35.56
     877.567     0.975000         7688        40.00
     899.583     0.978125         7713        45.71
     931.327     0.981250         7737        53.33
     991.743     0.984375         7761        64.00
    1013.247     0.985938         7775        71.11
    1023.999     0.987500         7786        80.00
    1050.623     0.989062         7798        91.43
    1091.583     0.990625         7811       106.67
    1130.495     0.992188         7824       128.00
    1144.831     0.992969         7829       142.22
    1169.407     0.993750         7835       160.00
    1186.815     0.994531         7841       182.86
    1212.415     0.995313         7848       213.33
    1230.847     0.996094         7854       256.00
    1238.015     0.996484         7857       284.44
    1250.303     0.996875         7860       320.00
    1258.495     0.997266         7863       365.71
    1285.119     0.997656         7866       426.67
    1318.911     0.998047         7869       512.00
    1339.391     0.998242         7871       568.89
    1346.559     0.998437         7873       640.00
    1354.751     0.998633         7874       731.43
    1374.207     0.998828         7875       853.33
    1415.167     0.999023         7877      1024.00
    1449.983     0.999121         7878      1137.78
    1449.983     0.999219         7878      1280.00
    1490.943     0.999316         7879      1462.86
    1513.471     0.999414         7880      1706.67
    1534.975     0.999512         7881      2048.00
    1534.975     0.999561         7881      2275.56
    1534.975     0.999609         7881      2560.00
    1541.119     0.999658         7882      2925.71
    1541.119     0.999707         7882      3413.33
    1554.431     0.999756         7883      4096.00
    1554.431     0.999780         7883      4551.11
    1554.431     0.999805         7883      5120.00
    1554.431     0.999829         7883      5851.43
    1554.431     0.999854         7883      6826.67
    1585.151     0.999878         7884      8192.00
    1585.151     1.000000         7884          inf
#[Mean    =      167.540, StdDeviation   =      233.371]
#[Max     =     1584.128, Total count    =         7884]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  7885 requests in 10.00s, 2.72MB read
  Non-2xx or 3xx responses: 7885
Requests/sec:    788.57
Transfer/sec:    278.77KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   191.04ms  206.52ms 931.84ms   86.98%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  147.07ms
 75.000%  270.33ms
 90.000%  455.42ms
 99.000%  931.84ms
 99.900%    1.50s 
 99.990%    2.23s 
 99.999%    2.26s 
100.000%    2.26s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.179     0.000000            1         1.00
      12.487     0.100000          885         1.11
      22.943     0.200000         1772         1.25
      38.815     0.300000         2655         1.43
      89.791     0.400000         3539         1.67
     147.071     0.500000         4424         2.00
     163.711     0.550000         4869         2.22
     180.223     0.600000         5310         2.50
     201.727     0.650000         5753         2.86
     234.495     0.700000         6194         3.33
     270.335     0.750000         6637         4.00
     292.351     0.775000         6861         4.44
     317.695     0.800000         7079         5.00
     344.319     0.825000         7301         5.71
     371.199     0.850000         7522         6.67
     407.039     0.875000         7743         8.00
     430.591     0.887500         7854         8.89
     455.423     0.900000         7963        10.00
     481.023     0.912500         8073        11.43
     508.927     0.925000         8184        13.33
     546.815     0.937500         8296        16.00
     564.223     0.943750         8351        17.78
     589.311     0.950000         8406        20.00
     617.471     0.956250         8460        22.86
     651.263     0.962500         8517        26.67
     685.055     0.968750         8571        32.00
     704.511     0.971875         8599        35.56
     733.183     0.975000         8627        40.00
     751.103     0.978125         8654        45.71
     798.207     0.981250         8682        53.33
     840.703     0.984375         8709        64.00
     861.183     0.985938         8723        71.11
     885.247     0.987500         8737        80.00
     910.847     0.989062         8751        91.43
     949.247     0.990625         8765       106.67
     985.087     0.992188         8778       128.00
    1000.959     0.992969         8785       142.22
    1018.367     0.993750         8792       160.00
    1068.031     0.994531         8799       182.86
    1091.583     0.995313         8806       213.33
    1121.279     0.996094         8813       256.00
    1156.095     0.996484         8816       284.44
    1171.455     0.996875         8820       320.00
    1198.079     0.997266         8823       365.71
    1227.775     0.997656         8827       426.67
    1297.407     0.998047         8830       512.00
    1318.911     0.998242         8832       568.89
    1353.727     0.998437         8834       640.00
    1414.143     0.998633         8835       731.43
    1443.839     0.998828         8837       853.33
    1576.959     0.999023         8839      1024.00
    1587.199     0.999121         8840      1137.78
    1601.535     0.999219         8841      1280.00
    1601.535     0.999316         8841      1462.86
    1833.983     0.999414         8842      1706.67
    1868.799     0.999512         8843      2048.00
    1894.399     0.999561         8844      2275.56
    1894.399     0.999609         8844      2560.00
    1894.399     0.999658         8844      2925.71
    1915.903     0.999707         8845      3413.33
    1915.903     0.999756         8845      4096.00
    2226.175     0.999780         8846      4551.11
    2226.175     0.999805         8846      5120.00
    2226.175     0.999829         8846      5851.43
    2226.175     0.999854         8846      6826.67
    2226.175     0.999878         8846      8192.00
    2260.991     0.999890         8847      9102.22
    2260.991     1.000000         8847          inf
#[Mean    =      191.041, StdDeviation   =      206.518]
#[Max     =     2258.944, Total count    =         8847]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  8848 requests in 10.00s, 3.05MB read
  Non-2xx or 3xx responses: 8848
Requests/sec:    884.88
Transfer/sec:    312.70KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    53.29ms  106.13ms 494.59ms   87.85%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.15ms
 75.000%   56.26ms
 90.000%  186.62ms
 99.000%  494.59ms
 99.900%  757.76ms
 99.990%  911.87ms
 99.999%  944.13ms
100.000%  944.13ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.159     0.000000            1         1.00
       0.286     0.100000          978         1.11
       0.450     0.200000         1949         1.25
       0.603     0.300000         2927         1.43
       0.796     0.400000         3901         1.67
       1.154     0.500000         4872         2.00
       1.731     0.550000         5360         2.22
       7.223     0.600000         5846         2.50
      16.103     0.650000         6334         2.86
      31.599     0.700000         6822         3.33
      56.447     0.750000         7308         4.00
      72.767     0.775000         7552         4.44
      88.767     0.800000         7795         5.00
     107.135     0.825000         8038         5.71
     127.423     0.850000         8282         6.67
     154.111     0.875000         8526         8.00
     169.727     0.887500         8647         8.89
     186.623     0.900000         8770        10.00
     205.055     0.912500         8893        11.43
     225.279     0.925000         9013        13.33
     250.111     0.937500         9136        16.00
     267.263     0.943750         9195        17.78
     286.463     0.950000         9256        20.00
     305.151     0.956250         9318        22.86
     326.655     0.962500         9378        26.67
     348.671     0.968750         9439        32.00
     363.263     0.971875         9469        35.56
     375.551     0.975000         9500        40.00
     390.399     0.978125         9530        45.71
     410.111     0.981250         9561        53.33
     438.271     0.984375         9591        64.00
     452.095     0.985938         9606        71.11
     470.783     0.987500         9622        80.00
     487.167     0.989062         9637        91.43
     503.039     0.990625         9652       106.67
     527.871     0.992188         9667       128.00
     543.231     0.992969         9675       142.22
     563.199     0.993750         9683       160.00
     573.951     0.994531         9690       182.86
     587.775     0.995313         9698       213.33
     615.423     0.996094         9705       256.00
     634.879     0.996484         9709       284.44
     643.583     0.996875         9713       320.00
     657.407     0.997266         9718       365.71
     667.647     0.997656         9721       426.67
     676.351     0.998047         9725       512.00
     679.423     0.998242         9726       568.89
     691.711     0.998437         9728       640.00
     695.807     0.998633         9730       731.43
     741.375     0.998828         9732       853.33
     760.319     0.999023         9734      1024.00
     772.095     0.999121         9735      1137.78
     774.143     0.999219         9736      1280.00
     779.263     0.999316         9737      1462.86
     783.871     0.999414         9738      1706.67
     787.455     0.999512         9739      2048.00
     787.455     0.999561         9739      2275.56
     814.591     0.999609         9740      2560.00
     814.591     0.999658         9740      2925.71
     841.215     0.999707         9741      3413.33
     841.215     0.999756         9741      4096.00
     841.215     0.999780         9741      4551.11
     911.871     0.999805         9742      5120.00
     911.871     0.999829         9742      5851.43
     911.871     0.999854         9742      6826.67
     911.871     0.999878         9742      8192.00
     911.871     0.999890         9742      9102.22
     944.127     0.999902         9743     10240.00
     944.127     1.000000         9743          inf
#[Mean    =       53.294, StdDeviation   =      106.129]
#[Max     =      943.616, Total count    =         9743]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9745 requests in 10.00s, 3.32MB read
  Non-2xx or 3xx responses: 9745
Requests/sec:    974.51
Transfer/sec:    340.08KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    70.65ms  124.01ms 573.95ms   87.27%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.69ms
 75.000%   98.43ms
 90.000%  227.58ms
 99.000%  573.95ms
 99.900%  852.48ms
 99.990%    1.01s 
 99.999%    1.07s 
100.000%    1.07s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.172     0.000000            1         1.00
       0.342     0.100000         1076         1.11
       0.526     0.200000         2143         1.25
       0.714     0.300000         3211         1.43
       0.962     0.400000         4283         1.67
       1.693     0.500000         5350         2.00
       7.119     0.550000         5884         2.22
      26.031     0.600000         6419         2.50
      46.911     0.650000         6955         2.86
      71.615     0.700000         7489         3.33
      98.431     0.750000         8023         4.00
     111.551     0.775000         8294         4.44
     128.511     0.800000         8558         5.00
     148.479     0.825000         8827         5.71
     171.519     0.850000         9093         6.67
     196.991     0.875000         9361         8.00
     210.431     0.887500         9495         8.89
     227.583     0.900000         9628        10.00
     250.879     0.912500         9763        11.43
     274.175     0.925000         9895        13.33
     299.263     0.937500        10030        16.00
     315.391     0.943750        10097        17.78
     326.655     0.950000        10163        20.00
     346.879     0.956250        10231        22.86
     366.591     0.962500        10296        26.67
     392.959     0.968750        10364        32.00
     406.015     0.971875        10397        35.56
     427.263     0.975000        10430        40.00
     445.439     0.978125        10464        45.71
     469.503     0.981250        10497        53.33
     498.431     0.984375        10530        64.00
     514.303     0.985938        10547        71.11
     534.527     0.987500        10564        80.00
     560.639     0.989062        10582        91.43
     587.263     0.990625        10597       106.67
     607.231     0.992188        10614       128.00
     625.663     0.992969        10622       142.22
     647.167     0.993750        10631       160.00
     670.207     0.994531        10639       182.86
     703.999     0.995313        10647       213.33
     730.111     0.996094        10657       256.00
     738.815     0.996484        10660       284.44
     751.103     0.996875        10664       320.00
     772.607     0.997266        10668       365.71
     795.647     0.997656        10672       426.67
     810.495     0.998047        10677       512.00
     821.247     0.998242        10679       568.89
     834.047     0.998437        10682       640.00
     837.631     0.998633        10683       731.43
     852.479     0.998828        10686       853.33
     861.695     0.999023        10687      1024.00
     866.815     0.999121        10688      1137.78
     871.935     0.999219        10689      1280.00
     902.655     0.999316        10690      1462.86
     907.775     0.999414        10691      1706.67
     916.991     0.999512        10692      2048.00
     918.015     0.999561        10693      2275.56
     918.015     0.999609        10693      2560.00
     959.487     0.999658        10694      2925.71
     959.487     0.999707        10694      3413.33
     963.583     0.999756        10695      4096.00
     963.583     0.999780        10695      4551.11
     963.583     0.999805        10695      5120.00
    1007.103     0.999829        10696      5851.43
    1007.103     0.999854        10696      6826.67
    1007.103     0.999878        10696      8192.00
    1007.103     0.999890        10696      9102.22
    1007.103     0.999902        10696     10240.00
    1072.127     0.999915        10697     11702.86
    1072.127     1.000000        10697          inf
#[Mean    =       70.651, StdDeviation   =      124.006]
#[Max     =     1071.104, Total count    =        10697]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  10699 requests in 10.00s, 3.64MB read
  Non-2xx or 3xx responses: 10699
Requests/sec:   1069.90
Transfer/sec:    373.00KB
Running 10s test @ http://localhost:8080/wrk2-api/review/compose
  1 threads and 100 connections
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    79.49ms  128.99ms 580.09ms   86.83%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    6.52ms
 75.000%  116.80ms
 90.000%  249.21ms
 99.000%  580.09ms
 99.900%  858.11ms
 99.990%    1.19s 
 99.999%    1.23s 
100.000%    1.23s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.172     0.000000            1         1.00
       0.399     0.100000         1168         1.11
       0.596     0.200000         2338         1.25
       0.809     0.300000         3504         1.43
       1.145     0.400000         4667         1.67
       6.519     0.500000         5831         2.00
      23.807     0.550000         6415         2.22
      42.207     0.600000         6999         2.50
      63.615     0.650000         7581         2.86
      89.471     0.700000         8164         3.33
     116.799     0.750000         8747         4.00
     132.735     0.775000         9040         4.44
     150.271     0.800000         9332         5.00
     168.447     0.825000         9622         5.71
     190.847     0.850000         9914         6.67
     215.295     0.875000        10205         8.00
     231.679     0.887500        10351         8.89
     249.215     0.900000        10497        10.00
     268.543     0.912500        10642        11.43
     290.815     0.925000        10789        13.33
     318.975     0.937500        10934        16.00
     331.519     0.943750        11007        17.78
     347.647     0.950000        11080        20.00
     366.847     0.956250        11153        22.86
     385.023     0.962500        11225        26.67
     412.415     0.968750        11298        32.00
     429.823     0.971875        11335        35.56
     450.559     0.975000        11371        40.00
     467.455     0.978125        11407        45.71
     485.631     0.981250        11444        53.33
     514.559     0.984375        11480        64.00
     530.943     0.985938        11499        71.11
     547.327     0.987500        11517        80.00
     564.223     0.989062        11535        91.43
     591.359     0.990625        11553       106.67
     616.959     0.992188        11571       128.00
     631.807     0.992969        11581       142.22
     640.511     0.993750        11590       160.00
     655.871     0.994531        11599       182.86
     671.743     0.995313        11608       213.33
     695.295     0.996094        11617       256.00
     708.095     0.996484        11623       284.44
     722.431     0.996875        11626       320.00
     747.007     0.997266        11631       365.71
     754.687     0.997656        11635       426.67
     772.607     0.998047        11640       512.00
     786.431     0.998242        11642       568.89
     800.767     0.998437        11644       640.00
     821.247     0.998633        11647       731.43
     841.215     0.998828        11649       853.33
     869.887     0.999023        11651      1024.00
     885.759     0.999121        11652      1137.78
     944.639     0.999219        11653      1280.00
    1011.711     0.999316        11655      1462.86
    1049.599     0.999414        11656      1706.67
    1051.647     0.999512        11657      2048.00
    1051.647     0.999561        11657      2275.56
    1087.487     0.999609        11658      2560.00
    1107.967     0.999658        11659      2925.71
    1107.967     0.999707        11659      3413.33
    1178.623     0.999756        11660      4096.00
    1178.623     0.999780        11660      4551.11
    1178.623     0.999805        11660      5120.00
    1188.863     0.999829        11661      5851.43
    1188.863     0.999854        11661      6826.67
    1188.863     0.999878        11661      8192.00
    1188.863     0.999890        11661      9102.22
    1188.863     0.999902        11661     10240.00
    1230.847     0.999915        11662     11702.86
    1230.847     1.000000        11662          inf
#[Mean    =       79.493, StdDeviation   =      128.989]
#[Max     =     1229.824, Total count    =        11662]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  11665 requests in 10.00s, 3.97MB read
  Non-2xx or 3xx responses: 11665
Requests/sec:   1166.50
Transfer/sec:    406.68KB